// pages/article/article.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    title:"厉害了！今年岭师8个省级科研平台获立项创新高",
    date:"2017-10-13",
    author:"新媒体中心",
       weixin:"岭南师范学院",
       content: "2017年度我校获8个省级科研平台，立项数在我校历年平台立项建设中居榜首。其中“特殊儿童心理评估与康复重点实验室”获广东省普通高校哲学社会科学重点实验室，这是本年度省内高校获立项建设的唯一一所哲学社会科学重点实验室，也是我校首个哲学社会科学重点实验室；学校申报的 6个科技平台全部入选广东省工程技术研究中心建设，立项数在省内非硕博高校中位居首位，也刷新我校在历年同类平台立项建设的记录；“广东省特色热带资源植物科技创新中心”入选广东省第一批现代农业科技创新中心建设。这些平台获得广东省立项建设，彰显了我校科研实力的整体提升，是学校领导高度重视和多年学科建设的结果，将为我校深入实施创新驱动发展战略，整合优势社会资源，培育优势创新团队，加快科研成果转化，提升我校自主创新能力，打下了坚实基础。 ",
       read:1376,
       zan:32
  },
  
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})